# Pandas Series

In [1]:
import pandas as pd

In [3]:
# series method
series = pd.Series([1,2,3,4,5,6,7])

In [4]:
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [12]:
# series method with index
series1 = pd.Series([1,2,3,4,5], index = ['a','s','e','f','c'])
print(series1)

a    1
s    2
e    3
f    4
c    5
dtype: int64

In [15]:
# Accesing index

print(series1['a'])
print(series1['f'])

1
4

# üêç Python ‚Äî Pandas DataFrame 
- A DataFrame is a 2-dimensional table-like data structure in Python (from the pandas library) used to store and analyze data in rows and columns, similar to an Excel sheet, SQL table, or CSV file.

{
    column_name : list_of_values
}
## Import pandas
```python
import pandas as pd

In [19]:
# DataFrame method using list method

data = pd.DataFrame([1,2,3,4,5,6])
print(data)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [16]:
# DataFrame method using dictionary method

data = {
    'Name': ['Asha', 'Ravi', 'John'],
    'Age': [23, 25, 30],
    'Score': [85, 90, 88]
}

df = pd.DataFrame(data)
df

   Name  Age  Score
0  Asha   23     85
1  Ravi   25     90
2  John   30     88

In [21]:
data.head()

   0
0  1
1  2
2  3
3  4
4  5

In [22]:
data = pd.DataFrame(
    {'Name': ['Tom', 'Jack', 'Steve', 'Ricky', 'Sam', 'Will', 'Root'],
        'Age': [28, 34, 29, 42, 17, 17, 45]},
    index=['C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7'])

data.head()

     Name  Age
C1    Tom   28
C2   Jack   34
C3  Steve   29
C4  Ricky   42
C5    Sam   17

In [28]:
# THIS STEP IS USED TO SELECT THE COLUME
data['Name']
data['Age']

C1    28
C2    34
C3    29
C4    42
C5    17
C6    17
C7    45
Name: Age, dtype: int64

In [29]:
data.head(10)

     Name  Age
C1    Tom   28
C2   Jack   34
C3  Steve   29
C4  Ricky   42
C5    Sam   17
C6   Will   17
C7   Root   45

In [42]:
# row selection

data.loc['C1','Name']    # it is used to just to retrive the data like by menctioning the lables
data.iloc[2,1]             # in this it works like by menctioning the position in the table

np.int64(29)